type TRoom =
  | "อาคาร 3"
  | "อาคารเจริญวิศวกรรม (อาคาร 4)"
  | "อาคารวิศวฯ 100 ปี"
  | "ลานจัดเลี้ยง อาคาร 3 (ที่ราบสูงสวนรวมใจ)";

const roomOptions = {
  "อาคาร 3": [
    {
      value: "หอประชุมใหญ่ (Hall of Intania)",
      label: "หอประชุมใหญ่ (Hall of Intania)",
    },
    { value: "ห้องทะเบียน", label: "ห้องทะเบียน" },
    { value: "ห้องรับรองอาจารย์", label: "ห้องรับรองอาจารย์" },
    { value: "ห้องละหมาด", label: "ห้องละหมาด" },
    { value: "ห้อง I-Think ชั้น 1", label: "ห้อง I-Think ชั้น 1" },
    { value: "ห้อง Toshiba ชั้น 1", label: "ห้อง Toshiba ชั้น 1" },
    { value: "ห้อง True Lab ชั้น 1", label: "ห้อง True Lab ชั้น 1" },
    { value: "ห้องสมุด", label: "ห้องสมุด" },
    { value: "ศูนย์คอมพิวเตอร์", label: "ศูนย์คอมพิวเตอร์" },
    {
      value: "บาบิโลน (ซุ้มการเวก อาคาร 3 ชั้น 2)",
      label: "บาบิโลน (ซุ้มการเวก อาคาร 3 ชั้น 2)",
    },
    { value: "other", label: "อื่นๆ" },
  ],
  "อาคารเจริญวิศวกรรม (อาคาร 4)": [
    { value: "หอประชุมชั้น 2", label: "หอประชุมชั้น 2" },
    {
      value: "โถงอาคารเจริญวิศวกรรม ชั้น 2",
      label: "โถงอาคารเจริญวิศวกรรม ชั้น 2",
    },
    {
      value: "โถงอาคารเจริญวิศวกรรม ชั้น 1 (โถงใต้ตึก 4)",
      label: "โถงอาคารเจริญวิศวกรรม ชั้น 1 (โถงใต้ตึก 4)",
    },
    { value: "other", label: "อื่นๆ" },
  ],
  "อาคารวิศวฯ 100 ปี": [
    { value: "โถงใต้อาคารวิศวฯ 100 ปี", label: "โถงใต้อาคารวิศวฯ 100 ปี" },
    { value: "ห้องลานเกียร์เย็น", label: "ห้องลานเกียร์เย็น" },
    { value: "Large Meeting Room", label: "Large Meeting Room" },
    { value: "สนามกีฬาชั้น 12", label: "สนามกีฬาชั้น 12" },
    { value: "Fitness ชั้น 12", label: "Fitness ชั้น 12" },
    { value: "other", label: "อื่นๆ" },
  ],
  "ลานจัดเลี้ยง อาคาร 3 (ที่ราบสูงสวนรวมใจ)": [
    { value: "พื้นที่จัดเลี้ยงหลัก", label: "พื้นที่จัดเลี้ยงหลัก" },
    { value: "เวทีกลางแจ้ง", label: "เวทีกลางแจ้ง" },
    { value: "other", label: "อื่นๆ" },
  ],
};

const fieldOptions = [
  { value: "ฝ่ายกิจการภายใน", label: "ฝ่ายกิจการภายใน" },
  { value: "ฝ่ายศิลปะและวัฒนธรรม", label: "ฝ่ายศิลปะและวัฒนธรรม" },
  { value: "ฝ่ายกีฬา", label: "ฝ่ายกีฬา" },
  {
    value: "ฝ่ายพัฒนาสังคมและบำเพ็ญประโยชน์",
    label: "ฝ่ายพัฒนาสังคมและบำเพ็ญประโยชน์",
  },
  {
    value: "ฝ่ายสวัสดิการนิสิตและสิ่งแวดล้อม",
    label: "ฝ่ายสวัสดิการนิสิตและสิ่งแวดล้อม",
  },
  { value: "ฝ่ายกิจการภายนอก", label: "ฝ่ายกิจการภายนอก" },
  { value: "ฝ่ายนิสิตสัมพันธ์", label: "ฝ่ายนิสิตสัมพันธ์" },
  { value: "ฝ่ายเทคโนโลยี", label: "ฝ่ายเทคโนโลยี" },
  { value: "ฝ่ายพัฒนาองค์กร", label: "ฝ่ายพัฒนาองค์กร" },
  {
    value: "ฝ่ายประชาสัมพันธ์และการตลาด",
    label: "ฝ่ายประชาสัมพันธ์และการตลาด",
  },
  { value: "ฝ่ายวิชาการ", label: "ฝ่ายวิชาการ" },
  { value: "ฝ่ายเลขานุการ", label: "ฝ่ายเลขานุการ" },
  { value: "โครงการอื่น ๆ ของกวศ.", label: "โครงการอื่น ๆ ของกวศ." },
];

const departmentOptins = [
  { value: "วิศวกรรมโยธา", label: "วิศวกรรมโยธา" },
  { value: "วิศวกรรมไฟฟ้า", label: "วิศวกรรมไฟฟ้า" },
  { value: "วิศวกรรมเครื่องกล", label: "วิศวกรรมเครื่องกล" },
  { value: "วิศวกรรมยานยนต์", label: "วิศวกรรมยานยนต์" },
  { value: "วิศวกรรมอุตสาหการ", label: "วิศวกรรมอุตสาหการ" },
  { value: "วิศวกรรมเคมี", label: "วิศวกรรมเคมี" },
  { value: "วิศวกรรมทรัพยากรธรณี", label: "วิศวกรรมทรัพยากรธรณี" },
  { value: "วิศวกรรมปิโตรเลียม", label: "วิศวกรรมปิโตรเลียม" },
  { value: "วิศวกรรมสิ่งแวดล้อม", label: "วิศวกรรมสิ่งแวดล้อม" },
  { value: "วิศวกรรมสำรวจ", label: "วิศวกรรมสำรวจ" },
  { value: "วิศวกรรมโลหการและวัสดุ", label: "วิศวกรรมโลหการและวัสดุ" },
  { value: "วิศวกรรมคอมพิวเตอร์", label: "วิศวกรรมคอมพิวเตอร์" },
  {
    value: "วิศวกรรมคอมพิวเตอร์และเทคโนโลยีดิจิทัล (CEDT)",
    label: "วิศวกรรมคอมพิวเตอร์และเทคโนโลยีดิจิทัล (CEDT)",
  },
  {
    value: "วิศวกรรมนิวเคลียร์และรังสี",
    label: "วิศวกรรมนิวเคลียร์และรังสี",
  },
  {
    value: "วิศวกรรมการออกแบบและการผลิตยานยนต์ (ADME)",
    label: "วิศวกรรมการออกแบบและการผลิตยานยนต์ (ADME)",
  },
  { value: "วิศวกรรมนาโน (NANO)", label: "วิศวกรรมนาโน (NANO)" },
  {
    value: "วิศวกรรมสารสนเทศและการสื่อสาร (ICE)",
    label: "วิศวกรรมสารสนเทศและการสื่อสาร (ICE)",
  },
  { value: "วิศวกรรมอากาศยาน (ADME)", label: "วิศวกรรมอากาศยาน (ADME)" },
  {
    value: "วิศวกรรมหุ่นยนต์และปัญญาประดิษฐ์ (AI)",
    label: "วิศวกรรมหุ่นยนต์และปัญญาประดิษฐ์ (AI)",
  },
  {
    value: "วิศวกรรมเคมีและกระบวนการ (ChPE)",
    label: "วิศวกรรมเคมีและกระบวนการ (ChPE)",
  },
  {
    value: "วิศวกรรมเซมิคอนดักเตอร์ (SEMI)",
    label: "วิศวกรรมเซมิคอนดักเตอร์ (SEMI)",
  },
];

const buildingOptions = [
  { value: "อาคาร 1", label: "อาคาร 1" },
  { value: "อาคาร 2", label: "อาคาร 2" },
  { value: "อาคาร 3", label: "อาคาร 3" },
  {
    value: "อาคารเจริญวิศวกรรม (อาคาร 4)",
    label: "อาคารเจริญวิศวกรรม (อาคาร 4)",
  },
  { value: "อาคารวิศวฯ 100 ปี", label: "อาคารวิศวฯ 100 ปี" },
  {
    value: "อาคารอนุสาสน์ยันตรกรรม (อาคาร 5)",
    label: "อาคารอนุสาสน์ยันตรกรรม (อาคาร 5)",
  },
  {
    value: "อาคารภาควิชาวิศวกรรมโยธาและสิ่งแวดล้อม",
    label: "อาคารภาควิชาวิศวกรรมโยธาและสิ่งแวดล้อม",
  },
  { value: "อาคารฮันส์ บันตลิ", label: "อาคารฮันส์ บันตลิ" },
  { value: "อาคารสลับ ลดาวัลย์", label: "อาคารสลับ ลดาวัลย์" },
  { value: "ลานเกียร์", label: "ลานเกียร์" },
  { value: "โรงอาหารคณะวิศวกรรมศาสตร์", label: "โรงอาหารคณะวิศวกรรมศาสตร์" },
  {
    value: "สนามบาสเกตบอลบริเวณอาคารภาควิชาวิศวกรรมโยธาและสิ่งแวดล้อม",
    label: "สนามบาสเกตบอลบริเวณอาคารภาควิชาวิศวกรรมโยธาและสิ่งแวดล้อม",
  },
  { value: "ซุ้มนิทรรศการ (ลาน ร.9)", label: "ซุ้มนิทรรศการ (ลาน ร.9)" },
  { value: "สวนรวมใจ", label: "สวนรวมใจ" },
  {
    value: "ลานจัดเลี้ยง อาคาร 3 (ที่ราบสูงสวนรวมใจ)",
    label: "ลานจัดเลี้ยง อาคาร 3 (ที่ราบสูงสวนรวมใจ)",
  },
  { value: "กิจนิสิต", label: "กิจนิสิต" },
  { value: "อื่นๆ", label: "อื่นๆ" },
];

const equipmentOptions = [
  { label: "ทีวี", value: "tv" },
  { label: "Projector", value: "projector" },
  { label: "เครื่องปรับอากาศ", value: "air_conditioner" },
  { label: "ไมโครโฟน", value: "microphone" },
];

const energyUnitOptions = [
  { label: "ยูนิตไฟฟ้า", value: "ยูนิตไฟฟ้า" },
  { label: "ปริมาณน้ำมันที่ใช้ (ลิตร)", value: "ปริมาณน้ำมันที่ใช้ (ลิตร)" },
];

const giftUnitOptions = [
  { value: "กระดาษ", label: "กระดาษ" },
  { value: "พลาสติก", label: "พลาสติก" },
  { value: "อื่นๆ", label: "อื่นๆ" },
];

const wasteOptions = [
  { value: "ขวดน้ำ", label: "ขวดน้ำ" },
  { value: "ขยะรีไซเคิล", label: "ขยะรีไซเคิล" },
  { value: "ขยะทั่วไป", label: "ขยะทั่วไป" },
  { value: "ขยะเศษอาหาร", label: "ขยะเศษอาหาร" },
  { value: "อื่นๆ", label: "อื่นๆ" },
];

export type { TRoom };
export {
  buildingOptions,
  departmentOptins,
  energyUnitOptions,
  equipmentOptions,
  fieldOptions,
  giftUnitOptions,
  roomOptions,
  wasteOptions,
};
